; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v6 - type_2 ?v3 - type_1)
 	      (pred_3 ?v1 - object ?v3 - type_1)
	      (pred_2 ?v6 - type_2 ?v5 - type_3)
	      (pred_1 ?v6 - type_2 ?v1 - object ?v5 - type_3))

   (:action op_3
       :parameters  (?v6 - type_2 ?v4 ?v2 - type_1)
       :precondition (and  (pred_4 ?v6 ?v4))
       :effect (and  (pred_4 ?v6 ?v2)
		     (not (pred_4 ?v6 ?v4))))

   (:action op_2
       :parameters (?v6 - type_2 ?v7 - object ?v8 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_3 ?v7 ?v8) (pred_4 ?v6 ?v8) (pred_2 ?v6 ?v5))
       :effect (and (pred_1 ?v6 ?v7 ?v5)
		    (not (pred_3 ?v7 ?v8)) 
		    (not (pred_2 ?v6 ?v5))))

   (:action op_1
       :parameters (?v6 - type_2 ?v7 - object ?v8 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_1 ?v6 ?v7 ?v5) (pred_4 ?v6 ?v8))
       :effect (and (pred_3 ?v7 ?v8)
		    (pred_2 ?v6 ?v5)
		    (not (pred_1 ?v6 ?v7 ?v5)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_11 obj_09 - type_2
obj_02 obj_07 obj_05 obj_01 - type_3
obj_06 obj_04 obj_08 - type_1
obj_10 obj_03 - object)
(:init
(pred_4 obj_11 obj_08)
(pred_2 obj_11 obj_02)
(pred_2 obj_11 obj_07)
(pred_4 obj_09 obj_04)
(pred_2 obj_09 obj_05)
(pred_2 obj_09 obj_01)
(pred_3 obj_10 obj_04)
(pred_3 obj_03 obj_04)
)
(:goal
(and
(pred_3 obj_10 obj_06)
(pred_3 obj_03 obj_08)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_11 obj_08) (pred_4 obj_09 obj_08))))
  )
)
)

; plan
1. (op_2 obj_09 obj_10 obj_04 obj_01)
   deleted: (pred_3 obj_10 obj_04) (pred_2 obj_09 obj_01)
   added: (pred_1 obj_09 obj_10 obj_01)
   goals met: 0 of 2
2. (op_2 obj_09 obj_03 obj_04 obj_05)
   deleted: (pred_3 obj_03 obj_04) (pred_2 obj_09 obj_05)
   added: (pred_1 obj_09 obj_03 obj_05)
   goals met: 0 of 2
3. (op_3 obj_11 obj_08 obj_06)
   deleted: (pred_4 obj_11 obj_08)
   added: (pred_4 obj_11 obj_06)
   goals met: 0 of 2
4. (op_3 obj_09 obj_04 obj_06)
   deleted: (pred_4 obj_09 obj_04)
   added: (pred_4 obj_09 obj_06)
   goals met: 0 of 2
5. (op_1 obj_09 obj_10 obj_06 obj_01)
   deleted: (pred_1 obj_09 obj_10 obj_01)
   added: (pred_3 obj_10 obj_06) (pred_2 obj_09 obj_01)
   goals met: 1 of 2
6. (op_3 obj_09 obj_06 obj_08)
   deleted: (pred_4 obj_09 obj_06)
   added: (pred_4 obj_09 obj_08)
   goals met: 1 of 2
7. (op_1 obj_09 obj_03 obj_08 obj_05)
   deleted: (pred_1 obj_09 obj_03 obj_05)
   added: (pred_3 obj_03 obj_08) (pred_2 obj_09 obj_05)
   goals met: 2 of 2
